// ЗАДАЧА № 1
// Задайте одномерный массив из 10 целых
// чисел от 1 до 100. Найдите количество элементов массива,
// значения которых лежат в отрезке [20,90].
/*
Console.Clear();

int[] array = new int[10];
for (int i = 0; i < array; i++)
{
   array[i] = new Random().Next(1, 101);  // [1,100]
Console.WriteLine(string.Join(", ", array));
}

int a = 20;
int b = 90;
int count = 0;
for (int i =0; i < array; i++)
    if ((array[i] >= a) && (array[i] <= b)) count++;
Console.WriteLine("Количество элементов в диапазоне " + count);
Console.ReadKey();
*/


            



    
